20240316T132944--kdoc-124-go-dlvelを使う__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:33:32Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 124: go-dlv.elを使う</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 124: go-dlv.elを使う</h1>
<div id="outline-container-org981c866" class="outline-2">
<h2 id="org981c866"><a href="#org981c866">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org981c866">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-03-16 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-04-03 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3352d98" class="outline-2">
<h2 id="org3352d98"><a href="#org3352d98">go-dlv.el</a></h2>
<div class="outline-text-2" id="text-org3352d98">
<p>
<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>のデバッガでdelveをよく使う。
</p>

<p>
Emacs上でこのdelveを扱いやすくするためのラッパーパッケージ<a href="https://github.com/benma/go-dlv.el/">go-dlv.el</a>がある。 <code>(dlv-current-func)</code> を実行してカーソル上の関数をデバッグ実行できる。
</p>

<p>
同じようなラッパーには <code>dap-mode</code> を使う方法もあるのだが、EmacsっぽくないUIなので、go-dlv.elの方が好み。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>(dlv-current-func)を実行したカーソル箇所にブレークポイントを打って実行してくれる。さらに該当コードは別バッファに表示されている</label><pre class="src src-nil">(dlv) Breakpoint 1 set at 0x78e853 for main.main() ./snippet.go:27
(dlv) &gt; main.main() ./snippet.go:27 (hits goroutine(1):1 total:1) (PC: 0x78e853)
    22:		if err != nil {
    23:			log.Fatal(err)
    24:		}
    25:	}
    26:
=&gt;  27:	func main() {
    28:		http.HandleFunc("/hello", helloHandler)
    29:		fmt.Println("Server Start Up........")
    30:		log.Fatal(http.ListenAndServe("localhost:8080", nil))
    31:	}
(dlv) n
&gt; main.main() ./snippet.go:28 (PC: 0x78e85a)
    23:			log.Fatal(err)
    24:		}
    25:	}
    26:
    27:	func main() {
=&gt;  28:		http.HandleFunc("/hello", helloHandler)
    29:		fmt.Println("Server Start Up........")
    30:		log.Fatal(http.ListenAndServe("localhost:8080", nil))
    31:	}
(dlv)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1a283e5" class="outline-2">
<h2 id="org1a283e5"><a href="#org1a283e5">関連</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
